Revit 2024 API
Alignment.EndStation Property
 Specifies the station at which the alignment's geometric definition ends, in Revit internal model units (standard Imperial feet).
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public double EndStation { get; }
Visual Basic
Public ReadOnly Property EndStation As Double
	Get
Visual C++
public:
property double EndStation {
	double get ();
}
Remarks
 This station may be outside the displayed range (DisplayedStartStation, DisplayedEndStation).
See Also
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace